In [ ]:
pip install mysql-connector-python

In [4]:
import mysql.connector     #importing data
database = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "",
    database = "python_class_8_am"
)
db = database.cursor()

In [5]:
db.execute("SELECT * FROM student")
result  = db.fetchall()
for x in result:
    print(x)

(16, 'Rabi', 88, 78, 72, 66, 82, 450, 80.0, 'A')
(18, 'Prakriti', 88, 78, 65, 58, 90, 420, 78.0, 'A')
(20, 'Ram', 77, 66, 87, 72, 55, 400, 72.0, 'B')
(21, 'Shyam', 98, 79, 89, 78, 77, 421, 84.2, 'A')

In [8]:
import mysql.connector     #importing data(inserting in MYSQL)
database = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "",
    database = "python_class_8_am"
)
db = database.cursor()
sql = '''INSERT INTO `student` (`sn`,`name`, `physics` , `chemistry` , `math` , `english` , `nepali` , `total` , `per`, `grade` ) 
VALUES('22','Susmita','77','88','77','67','68','430','79','A');'''
db.execute(sql)
database.commit()
print(db.rowcount,"record inserted.")

1 record inserted.

In [7]:
# WAP of five subject and calculate total marks ,percentage and grade. (mysql)

name = input("Enter name = ")
physics = int(input("enter the physics marks="))
chemistry = int(input("enter the chemistry marks ="))
math = int(input("enter the math marks ="))
english = int(input("enter the english marks ="))
nepali = int(input("enter the nepali marks ="))

total = physics + chemistry + math + english + nepali
per = total/5
if per >= 75:
  grade = "A"
elif per >= 70:
  grade = "B"
elif per >= 65:
  grade="C"
elif per >= 60:
  grade = "D"
else:
  grade = "F"

#(inserting data into table)

sql = f'''INSERT INTO student (name,physics,chemistry,math,english,nepali,total,per,grade )
    VALUES('{name}',{physics},{chemistry},{math},{english},{nepali},{total},{per},'{grade}')'''
db.execute(sql)
database.commit()
print(db.rowcount,"record inserted.")

Enter name =  Shyam
enter the physics marks= 98
enter the chemistry marks = 79
enter the math marks = 89
enter the english marks = 78
enter the nepali marks = 77

1 record inserted.

In [11]:
# Update in MySQL 

sql = "UPDATE student SET name = 'Anishka' WHERE sn = 20"
db.execute(sql)
database.commit()
print(db.rowcount,"record(s) affected")

1 record(s) affected

In [13]:
# Delete in MYSQL

import mysql.connector     #importing data
database = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "",
    database = "python_class_8_am"
)
db = database.cursor()
sql = "DELETE FROM student  WHERE sn  = 21" 
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) delete")

0 record(s) delete

In [14]:
# Delete in MYSQL

import mysql.connector     #importing data
database = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "",
    database = "python_class_8_am"
)
db = database.cursor()
sql = "DELETE FROM student  WHERE sn  = 25" 
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) delete")

1 record(s) delete

In [16]:
# Select maa yesari pani select garna sakxau 

db.execute("SELECT * FROM student WHERE grade = 'A'")
result  = db.fetchall()
for x in result:
    print(x)

(16, 'Rabi', 88, 78, 72, 66, 82, 450, 80.0, 'A')
(18, 'Prakriti', 88, 78, 65, 58, 90, 420, 78.0, 'A')
(22, 'Susmita', 77, 88, 77, 67, 68, 430, 79.0, 'A')

In [17]:
# Select maa yesari pani select garna sakxau 

db.execute("SELECT * FROM student WHERE physics> 75")
result  = db.fetchall()
for x in result:
    print(x)

(16, 'Rabi', 88, 78, 72, 66, 82, 450, 80.0, 'A')
(18, 'Prakriti', 88, 78, 65, 58, 90, 420, 78.0, 'A')
(20, 'Anishka', 77, 66, 87, 72, 55, 400, 72.0, 'B')
(22, 'Susmita', 77, 88, 77, 67, 68, 430, 79.0, 'A')

In [18]:
# Search in MYSQL

db.execute("SELECT * FROM student WHERE name LIKE '%Susmita%'")  # LIKE vanira vanda similar type ka value lai disply garxa
result  = db.fetchall()
for x in result:
    print(x)

(22, 'Susmita', 77, 88, 77, 67, 68, 430, 79.0, 'A')

In [19]:
# Select maa yesari pani select garna sakxau 

db.execute("SELECT * FROM student WHERE physics> 75 and chemistry = 78")
result  = db.fetchall()
for x in result:
    print(x)

(16, 'Rabi', 88, 78, 72, 66, 82, 450, 80.0, 'A')
(18, 'Prakriti', 88, 78, 65, 58, 90, 420, 78.0, 'A')

In [20]:
# Select maa yesari pani select garna sakxau 

db.execute("SELECT * FROM student WHERE physics> 75 or chemistry >= 78")
result  = db.fetchall()
for x in result:
    print(x)

(16, 'Rabi', 88, 78, 72, 66, 82, 450, 80.0, 'A')
(18, 'Prakriti', 88, 78, 65, 58, 90, 420, 78.0, 'A')
(20, 'Anishka', 77, 66, 87, 72, 55, 400, 72.0, 'B')
(22, 'Susmita', 77, 88, 77, 67, 68, 430, 79.0, 'A')

In [21]:
# Select maa yesari pani select garna sakxau 

db.execute("SELECT name, total,per,grade FROM student ")
result  = db.fetchall()
for x in result:
    print(x)

('Rabi', 450, 80.0, 'A')
('Prakriti', 420, 78.0, 'A')
('Anishka', 400, 72.0, 'B')
('Susmita', 430, 79.0, 'A')

In [23]:
# Select maa yesari pani select garna sakxau 

db.execute("SELECT * FROM student ORDER BY total DESC") # DESC vaniko decending order maa vanna khojiko
result  = db.fetchall()
for x in result:
    print(x)

(16, 'Rabi', 88, 78, 72, 66, 82, 450, 80.0, 'A')
(22, 'Susmita', 77, 88, 77, 67, 68, 430, 79.0, 'A')
(18, 'Prakriti', 88, 78, 65, 58, 90, 420, 78.0, 'A')
(20, 'Anishka', 77, 66, 87, 72, 55, 400, 72.0, 'B')

In [24]:
# Select maa yesari pani select garna sakxau 

db.execute("SELECT * FROM student ORDER BY total DESC") # DESC vaniko decending order maa vanna khojiko
result  = db.fetchall()
for x in result[0:2]: # top two student ko datail nekaliko 
    print(x)

(16, 'Rabi', 88, 78, 72, 66, 82, 450, 80.0, 'A')
(22, 'Susmita', 77, 88, 77, 67, 68, 430, 79.0, 'A')

In [1]:
import mysql.connector
database = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "",
    database = "python_first_class"
)

db = database.cursor()

In [15]:
db.execute("SELECT * FROM employee")
result  = db.fetchall()
for x in result:
    print(x)